package KI305.Hryn.Lab6;

/**
 * Інтерфейс, який представляє дані, що можна порівнювати за віком.
 * Класи, які реалізовують цей інтерфейс, повинні надавати інформацію про вік та надавати можливість порівнювати дані за віком.
 */
interface Data extends Comparable<Data> {

    /**
     * Отримати вік об'єкта даних.
     *
     * @return Вік об'єкта даних.
     */
    public int getAge();

    /**
     * Вивести інформацію про об'єкт даних.
     */
    public void print();

    /**
     * Отримати ім'я об'єкта даних.
     *
     * @return Ім'я об'єкта даних.
     */
    public String getName();
}
