package KI305.Hryn.Lab3;

/**
 * Інтерфейс, що представляє функціональність керування світлами.
 * Реалізуючі класи повинні реалізовувати методи цього інтерфейсу для управління світлами і надавати інформацію про їх стан.
 */
public interface ILights {

    /**
     * Встановлює стан світла (увімкнено або вимкнено).
     *
     * @param data true, якщо світло має бути увімкнено, false, якщо світло має бути вимкнено.
     */
    void setLights(boolean data);

    /**
     * Виводить інформацію про поточний стан світла.
     */
    void lightInfo();
}

